tutorials/porousMediaFluid/tubeHeating/constant/momentumTransport
FoamFile {
    class dictionary;
    format ascii;
    object momentumTransport;
}

simulationType laminar;