tutorials/porousMediaFluid/tubeHeating/constant/physicalProperties
FoamFile {
    class dictionary;
    format ascii;
    object physicalProperties;
}

pOffset 1e6[Pa];

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState PengRobinsonGas;
    // equationOfState RedlichKwongGas;
    // equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie {
        molWeight   28.9[kg/kmol];
        Tc          126.15[K];
        Pc          3.394e6[Pa];
        Vc          0.0886885[m^3/kmol];
        omega       0.045;
    }
    equationOfState {
    }
    thermodynamics {
        Cp          1007;
        Cv          719.32;
        hf          0;
    }
    transport {
        mu          1.84e-05;
        Pr          0.7;
    }
}