tutorials/porousMediaFluid/tubeHeating/0/T
FoamFile {
    class volScalarField;
    object T;
    format ascii;
}

dimensions [temperature];
internalField uniform 273;


boundaryField {
    gas_wall {
        type zeroGradient;
    }
    porous_wall {
        type fixedValue;
        value uniform 373;
    }
    symmetry {
        type symmetry;
    }
    inlet {
        type fixedValue;
        value $internalField;
    }
    outlet {
        type zeroGradient;
    }
}